tests/normal_benchmark.txt
// running 3 rust servers
thanos> hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	48.6767 secs
  Slowest:	0.1251 secs
  Fastest:	0.0001 secs
  Average:	0.0048 secs
  Requests/sec:	20543.7075
  
  Total data:	12000000 bytes
  Size/request:	12 bytes

Response time histogram:
  0.000 [1]	|
  0.013 [970634]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [25701]	|■
  0.038 [2108]	|
  0.050 [781]	|
  0.063 [435]	|
  0.075 [145]	|
  0.088 [91]	|
  0.100 [69]	|
  0.113 [5]	|
  0.125 [30]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0023 secs
  50% in 0.0042 secs
  75% in 0.0064 secs
  90% in 0.0089 secs
  95% in 0.0110 secs
  99% in 0.0172 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1251 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0059 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0518 secs
  resp wait:	0.0045 secs, 0.0000 secs, 0.1250 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0895 secs

Status code distribution:
  [200]	1000000 responses# haproxy
haproxy> hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	49.9404 secs
  Slowest:	0.0770 secs
  Fastest:	0.0001 secs
  Average:	0.0050 secs
  Requests/sec:	20023.8529
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [823587]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [163059]	|■■■■■■■■
  0.023 [10817]	|■
  0.031 [1714]	|
  0.039 [495]	|
  0.046 [130]	|
  0.054 [108]	|
  0.062 [56]	|
  0.069 [1]	|
  0.077 [32]	|


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0024 secs
  50% in 0.0044 secs
  75% in 0.0067 secs
  90% in 0.0094 secs
  95% in 0.0113 secs
  99% in 0.0166 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0770 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0112 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0424 secs
  resp wait:	0.0046 secs, 0.0001 secs, 0.0745 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0682 secs

Status code distribution:
  [200]	1000000 responses

# envoy
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	55.4017 secs
  Slowest:	0.0970 secs
  Fastest:	0.0001 secs
  Average:	0.0055 secs
  Requests/sec:	18049.9818
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.010 [897587]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [93159]	|■■■■
  0.029 [7237]	|
  0.039 [1453]	|
  0.049 [370]	|
  0.058 [107]	|
  0.068 [51]	|
  0.078 [7]	|
  0.087 [14]	|
  0.097 [14]	|


Latency distribution:
  10% in 0.0018 secs
  25% in 0.0030 secs
  50% in 0.0048 secs
  75% in 0.0071 secs
  90% in 0.0099 secs
  95% in 0.0121 secs
  99% in 0.0190 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0970 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0365 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0171 secs
  resp wait:	0.0052 secs, 0.0001 secs, 0.0772 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0338 secs

Status code distribution:
  [200]	1000000 responses

# running thanos with least connections
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	47.8105 secs
  Slowest:	0.1675 secs
  Fastest:	0.0001 secs
  Average:	0.0047 secs
  Requests/sec:	20915.9212
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.017 [990501]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [7824]	|
  0.050 [980]	|
  0.067 [385]	|
  0.084 [164]	|
  0.101 [122]	|
  0.117 [15]	|
  0.134 [2]	|
  0.151 [3]	|
  0.167 [3]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0023 secs
  50% in 0.0042 secs
  75% in 0.0063 secs
  90% in 0.0087 secs
  95% in 0.0106 secs
  99% in 0.0165 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1675 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0109 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0971 secs
  resp wait:	0.0044 secs, 0.0000 secs, 0.1063 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.1528 secs

Status code distribution:
  [200]	1000000 responses

// running haproxy with least connections
hey -n 1000000 -c 100 http://localhost:8080

Summary:
  Total:	51.1317 secs
  Slowest:	0.0671 secs
  Fastest:	0.0001 secs
  Average:	0.0051 secs
  Requests/sec:	19557.3434
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [742466]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [232701]	|■■■■■■■■■■■■■
  0.020 [20805]	|■
  0.027 [3308]	|
  0.034 [525]	|
  0.040 [102]	|
  0.047 [19]	|
  0.054 [48]	|
  0.060 [20]	|
  0.067 [5]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0025 secs
  50% in 0.0045 secs
  75% in 0.0069 secs
  90% in 0.0094 secs
  95% in 0.0114 secs
  99% in 0.0168 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0671 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0213 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0138 secs
  resp wait:	0.0046 secs, 0.0001 secs, 0.0370 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0375 secs

Status code distribution:
  [200]	1000000 responses

# running envoy with least connections
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	55.3275 secs
  Slowest:	0.0666 secs
  Fastest:	0.0001 secs
  Average:	0.0055 secs
  Requests/sec:	18074.1815
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [716585]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [247109]	|■■■■■■■■■■■■■■
  0.020 [27670]	|■■
  0.027 [6122]	|
  0.033 [1542]	|
  0.040 [536]	|
  0.047 [286]	|
  0.053 [70]	|
  0.060 [47]	|
  0.067 [32]	|


Latency distribution:
  10% in 0.0017 secs
  25% in 0.0029 secs
  50% in 0.0048 secs
  75% in 0.0072 secs
  90% in 0.0100 secs
  95% in 0.0123 secs
  99% in 0.0192 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0666 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0135 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0365 secs
  resp wait:	0.0052 secs, 0.0001 secs, 0.0666 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0393 secs

Status code distribution:
  [200]	1000000 responses

// 8 kb buffer
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	49.7722 secs
  Slowest:	0.1284 secs
  Fastest:	0.0001 secs
  Average:	0.0049 secs
  Requests/sec:	20091.5303
  
  Total data:	12000000 bytes
  Size/request:	12 bytes

Response time histogram:
  0.000 [1]	|
  0.013 [973587]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [24041]	|■
  0.039 [1613]	|
  0.051 [248]	|
  0.064 [184]	|
  0.077 [149]	|
  0.090 [61]	|
  0.103 [102]	|
  0.116 [11]	|
  0.128 [3]	|


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0025 secs
  50% in 0.0043 secs
  75% in 0.0066 secs
  90% in 0.0091 secs
  95% in 0.0110 secs
  99% in 0.0167 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1284 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0111 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0732 secs
  resp wait:	0.0045 secs, 0.0000 secs, 0.1283 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.1055 secs

Status code distribution:
  [200]	1000000 responses
// 64 kb buffer 
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	50.2985 secs
  Slowest:	0.1505 secs
  Fastest:	0.0001 secs
  Average:	0.0050 secs
  Requests/sec:	19881.3209
  
  Total data:	12000000 bytes
  Size/request:	12 bytes

Response time histogram:
  0.000 [1]	|
  0.015 [985571]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.030 [13245]	|■
  0.045 [630]	|
  0.060 [133]	|
  0.075 [181]	|
  0.090 [125]	|
  0.105 [91]	|
  0.120 [9]	|
  0.135 [7]	|
  0.150 [7]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0025 secs
  50% in 0.0044 secs
  75% in 0.0067 secs
  90% in 0.0092 secs
  95% in 0.0111 secs
  99% in 0.0165 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1505 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0151 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0683 secs
  resp wait:	0.0045 secs, 0.0000 secs, 0.1504 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0876 secs

Status code distribution:
  [200]	1000000 responses

// 16 kb buffer
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	49.8982 secs
  Slowest:	0.1137 secs
  Fastest:	0.0001 secs
  Average:	0.0050 secs
  Requests/sec:	20040.7876
  
  Total data:	12000000 bytes
  Size/request:	12 bytes

Response time histogram:
  0.000 [1]	|
  0.011 [955121]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [41817]	|■■
  0.034 [2301]	|
  0.046 [548]	|
  0.057 [125]	|
  0.068 [18]	|
  0.080 [5]	|
  0.091 [10]	|
  0.102 [48]	|
  0.114 [6]	|


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0025 secs
  50% in 0.0044 secs
  75% in 0.0067 secs
  90% in 0.0092 secs
  95% in 0.0111 secs
  99% in 0.0167 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1137 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0085 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0191 secs
  resp wait:	0.0045 secs, 0.0000 secs, 0.1013 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.1074 secs

Status code distribution:
  [200]	1000000 responses

  // 32 kb buffer
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	49.9474 secs
  Slowest:	0.1227 secs
  Fastest:	0.0001 secs
  Average:	0.0050 secs
  Requests/sec:	20021.0716
  
  Total data:	12000000 bytes
  Size/request:	12 bytes

Response time histogram:
  0.000 [1]	|
  0.012 [967473]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [29683]	|■
  0.037 [2026]	|
  0.049 [398]	|
  0.061 [210]	|
  0.074 [64]	|
  0.086 [27]	|
  0.098 [66]	|
  0.110 [37]	|
  0.123 [15]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0025 secs
  50% in 0.0044 secs
  75% in 0.0066 secs
  90% in 0.0091 secs
  95% in 0.0110 secs
  99% in 0.0168 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1227 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0112 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0764 secs
  resp wait:	0.0045 secs, 0.0000 secs, 0.1227 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.1104 secs

Status code distribution:
  [200]	1000000 responses